content/index.org
#+title: Bash Notes
#+options: toc:nil

* Table of Contents
** [[./intro.org][1.0 Intro]]
+ [[./intro.org::*History][1.1 History]]
+ [[./intro.org::*Software tools principles][1.2 Software tools principles]]
  - [[./intro.org::*Do one thing well][1.3 Do one thing well]]
  - [[./intro.org::*Process lines of text, not binary][1.4 Process lines of text, not binary]]
  - [[./intro.org::*Use Regular Expressions][1.5 Use Regular Expressions]]
  - [[./intro.org::*Default to std in/out][1.6 Default to std in/out]]
  - [[./intro.org::*Don't be chatty][1.7 Don't be chatty]]
  - [[./intro.org::*Use the input format for output][1.8 Use the input format for output]]
  - [[./intro.org::*Let someone else do the hard part][1.9 Let someone else do the hard part]]
  - [[./intro.org::*Detour to write specilized tools][1.10 Detour to write specilized tools]]
+ [[./intro.org::*Self contained scripts][1.11 Self contained scripts]]
  - [[./intro.org::*Creating a script][1.12 Creating a script]]
    - [[./intro.org::*understand tools you can use][1.13 understand tools you can use]]
    - [[./intro.org::*write it][1.14 write it]]
    - [[./intro.org::*make it executable][1.15 make it executable]]
    - [[./intro.org::*run!][1.16 run!]]
    - [[./intro.org::*Lets change our script][1.17 Lets change our script]]
  - [[./intro.org::*How simple script works][1.18 How simple script works]]
  - [[./intro.org::*Interpreter in a script][1.19 Interpreter in a script]]
  - [[./intro.org::*=man= and =help=][1.20 =man= and =help=]]

** [[./variables-and-simple-output.org][2.0 Variables and Simple Output]]
+ [[./variables-and-simple-output.org::*Variables][2.1 Variables]]
  - [[./variables-and-simple-output.org::*Quoting issues][2.2 Quoting issues]]
+ [[./variables-and-simple-output.org::*Output][2.3 Output]]
  - [[./variables-and-simple-output.org::*=echo=][2.4 =echo=]]
  - [[./variables-and-simple-output.org::*=printf=][2.5 =printf=]]

** [[./arguments.org][3.0 Script Arguments]]
+ [[./arguments.org::*Getting arguments][3.1 Getting arguments]]
+ [[./arguments.org::*Processing arguments][3.2 Processing arguments]]

** [[./quoting-and-execution-tracing.org][4.0 Quoting and Execution Tracting]]
+ [[./quoting-and-execution-tracing.org::*Backslash escaping][4.1 Backslash escaping]]
+ [[./quoting-and-execution-tracing.org::*Single quotes][4.2 Single quotes]]
+ [[./quoting-and-execution-tracing.org::*Double quotes][4.3 Double quotes]]
+ [[./quoting-and-execution-tracing.org::*Execution tracing][4.4 Execution tracing]]
  - [[./quoting-and-execution-tracing.org::*Demo 1 - sh][4.5 Demo 1 - sh]]
  - [[./quoting-and-execution-tracing.org::*Demo 2 - bash][4.6 Demo 2 - bash]]

** [[./redirection-and-special-files.org][5.0 Redirection and Special Files]]
+ [[./redirection-and-special-files.org::*File redirection][5.1 File redirection]]
+ [[./redirection-and-special-files.org::*Pipelines][5.2 Pipelines]]
+ [[./redirection-and-special-files.org::*Redirecting =stderr= vs =stdout=][5.3 Redirecting =stderr= vs =stdout=]]
+ [[./redirection-and-special-files.org::*Here documents][5.4 Here documents]]
+ [[./redirection-and-special-files.org::*Special files][5.5 Special files]]
  - [[./redirection-and-special-files.org::*=/dev/null=][5.6 =/dev/null=]]
  - [[./redirection-and-special-files.org::*=/dev/tty=][5.7 =/dev/tty=]]

** [[./command-types.org][6.0 Command Types; Command and Directory Searching]]
+ [[./command-types.org::*Types of commands][6.1 Types of commands]]
+ [[./command-types.org::*=PATH=][6.2 =PATH=]]

** [[./simple-text-processing.org][7.0 Simple Text Processing]]
+ [[./simple-text-processing.org::*Counting lines, words, chars][7.1 Counting lines, words, chars]]
+ [[./simple-text-processing.org::*Transforming text][7.2 Transforming text]]
+ [[./simple-text-processing.org::*Converting tabs vs spaces][7.3 Converting tabs vs spaces]]
+ [[./simple-text-processing.org::*First or last few lines][7.4 First or last few lines]]

** [[./regular-expressions.org][8.0 Regular Expressions]]
+ [[./regular-expressions.org::*BREs][8.1 BREs]]
  - [[./regular-expressions.org::*Regular expression concepts][8.2 Regular expression concepts]]
    - [[./regular-expressions.org::*=grep= options][8.3 =grep= options]]
    - [[./regular-expressions.org::*Robustness][8.4 Robustness]]
  - [[./regular-expressions.org::*Basic regex components][8.5 Basic regex components]]
    - [[./regular-expressions.org::*single char expressions][8.6 single char expressions]]
    - [[./regular-expressions.org::*bracket expressions][8.7 bracket expressions]]
    - [[./regular-expressions.org::*repetition - zero or more][8.8 repetition - zero or more]]
    - [[./regular-expressions.org::*repetition - interval expressions][8.9 repetition - interval expressions]]
    - [[./regular-expressions.org::*achoring maches][8.10 achoring maches]]
    - [[./regular-expressions.org::*parenthasized subexpressions][8.11 parenthasized subexpressions]]
    - [[./regular-expressions.org::*operator precedence][8.12 operator precedence]]
    - [[./regular-expressions.org::*longest, leftmost match][8.13 longest, leftmost match]]
+ [[./regular-expressions.org::*EREs][8.14 EREs]]
  - [[./regular-expressions.org::*Regular expression concepts][8.15 Regular expression concepts]]
    - [[./regular-expressions.org::*=grep= options][8.16 =grep= options]]
    - [[./regular-expressions.org::*Robustness][8.17 Robustness]]
  - [[./regular-expressions.org::*Basic regex components][8.18 Basic regex components]]
  - [[./regular-expressions.org::*Aditional repetition operators][8.19 Aditional repetition operators]]
  - [[./regular-expressions.org::*Grouping with parenthesis][8.20 Grouping with parenthesis]]
  - [[./regular-expressions.org::*Alternation][8.21 Alternation]]
  - [[./regular-expressions.org::*ERE operator precedence][8.22 ERE operator precedence]]
  - [[./regular-expressions.org::*Robustness][8.23 Robustness]]
  - [[./regular-expressions.org::*Using plain grep][8.24 Using plain grep]]

** [[./sed.org][9.0 sed]]
+ [[./sed.org::*Intro][9.1 Intro]]
+ [[./sed.org::*Input flow][9.2 Input flow]]
+ [[./sed.org::*Options][9.3 Options]]
+ [[./sed.org::*Command structure][9.4 Command structure]]
+ [[./sed.org::*Substitute command][9.5 Substitute command]]
  - [[./sed.org::*Replacement][9.6 Replacement]]
  - [[./sed.org::*Flags][9.7 Flags]]
  - [[./sed.org::*Robustness][9.8 Robustness]]
+ [[./sed.org::*Examples][9.9 Examples]]
  - [[./sed.org::*Matching and removing][9.10 Matching and removing]]
  - [[./sed.org::*Printing][9.11 Printing]]
  - [[./sed.org::*Quit command][9.12 Quit command]]
  - [[./sed.org::*Generate commands][9.13 Generate commands]]

** [[./tilde-wildcards-and-hidden-files.org][10.0 Tilde, Wildcards and Hidden Files]]
+ [[./tilde-wildcards-and-hidden-files.org::*Tilde expansion][10.1 Tilde expansion]]
+ [[./tilde-wildcards-and-hidden-files.org::*Wildcarding][10.2 Wildcarding]]
+ [[./tilde-wildcards-and-hidden-files.org::*Hidden files][10.3 Hidden files]]

** [[./extended-pattern-matching.org][11.0 Extended Pattern Matching]]
+ [[./extended-pattern-matching.org::*Intro][11.1 Intro]]
+ [[./extended-pattern-matching.org::*Extended notations][11.2 Extended notations]]
+ [[./extended-pattern-matching.org::*Use cases][11.3 Use cases]]
+ [[./extended-pattern-matching.org::*Robustness][11.4 Robustness]]

** [[./cut-and-join.org][12.0 Cut and Join]]
+ [[./cut-and-join.org::*Choosing fields with =cut=][12.1 Choosing fields with =cut=]]

** [[./shell-expansions.org][100.0 Shell Expansions]]
+ [[./shell-expansions.org::*Default values][100.1 Default values]]
+ [[./shell-expansions.org::*Required parameters with error][100.2 Required parameters with error]]
+ [[./shell-expansions.org::*String manipulation][100.3 String manipulation]]

